autumnTQ/STM32F407/2.测试程序/1.模拟下位机与电机通信/HARDWARE/TOUCH/touch.c
/**
 ****************************************************************************************************
 * @file        touch.c
 * @author      正点原子团队(ALIENTEK)
 * @version     V1.0
 * @date        2022-10-15
 * @brief       触摸屏驱动代码
 * @note        支持电阻、电容式触摸屏
 *              触摸屏驱动支持ADS7843/7846/UH7843/7846/XPT2046/TSC2046/GT9147/GT9271/FT5206等
 * @license     Copyright (c) 2020-2032, 广州市星翼电子科技有限公司
 ****************************************************************************************************
 * @attention
 * 
 * 实验平台:正点原子 APM32F407最小系统板
 * 在线视频:www.yuanzige.com
 * 技术论坛:www.openedv.com
 * 公司网址:www.alientek.com
 * 购买地址:openedv.taobao.com
 * 
 ****************************************************************************************************
 */
#include "touch.h"
#include "gt9xxx.h"
#include "ft5206.h"
#include "lcd.h"
#include "24cxx.h"
#include "stm32f4xx_rcm.h"
#include "stm32f4xx_gpio.h"
#include "delay.h"
#include <stdio.h>
#include <stdlib.h>

/* 触摸屏控制结构体变量 */
_m_tp_dev tp_dev =
{
    tp_init,
    tp_scan,
    tp_adjust,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
};

/**
 * @brief       SPI写数据
 * @param       data: 要写入的数据
 * @retval      无
 */
static void tp_write_byte(uint8_t data)
{
    uint8_t count;
    
    for (count=0; count<8; count++)
    {
        if (data & 0x80)    /* 发送1 */
        {
            T_MOSI(1);
        }
        else                /* 发送0 */
        {
            T_MOSI(0);
        }
        
        data <<= 1;
        T_CLK(0);
        delay_us(1);
        T_CLK(1);           /* 上升沿有效 */
    }
}

/**
 * @brief       SPI读数据
 * @param       cmd: 指令
 * @retval      读取到的数据
 */
static uint16_t tp_read_ad(uint8_t cmd)
{
    uint8_t count;
    uint16_t num = 0;
    
    T_CLK(0);                           /* 先拉低时钟 */
    T_MOSI(0);                          /* 拉低数据线 */
    T_CS(0);                            /* 选中触摸屏IC */
    tp_write_byte(cmd);                 /* 发送命令 */
    delay_us(6);                        /* ADS7846的转换时间最长为6us */
    T_CLK(0);
    delay_us(1);
    T_CLK(1);                           /* 给1个时钟，清除BUSY */
    delay_us(1);
    T_CLK(0);
    
    for (count=0; count<16; count++)    /* 读出16位数据，只有高12位有效 */
    {
        num <<= 1;
        T_CLK(0);                       /* 下降沿有效 */
        delay_us(1);
        T_CLK(1);
        if (T_MISO)
        {
            num++;
        }
    }
    
    num >>= 4;                          /* 只有高12位有效 */
    T_CS(1);                            /* 释放片选 */
    
    return num;
}

/* 电阻触摸驱动相关参数定义 */
#define TP_READ_TIMES   5   /* 读取次数 */
#define TP_LOST_VAL     1   /* 丢弃值 */

/**
 * @brief       读取一个坐标值（x或y）
 * @note        连续读取TP_READ_TIMES次数据,对这些数据升序排列,
 *              然后去掉最低和最高TP_LOST_VAL个数，取平均值
 *              设置时需满足：TP_READ_TIMES > 2*TP_LOST_VAL 的条件
 * @param       cmd : 指令
 *   @arg       0x90: 读取X轴坐标（竖屏状态，横屏状态和Y对调）
 *   @arg       0xD0: 读取Y轴坐标（竖屏状态，横屏状态和X对调）
 * @retval      读取到的数据（滤波后的），ADC值（12bit）
 */
static uint16_t tp_read_xoy(uint8_t cmd)
{
    uint16_t i, j;
    uint16_t buf[TP_READ_TIMES];
    uint16_t sum = 0;
    uint16_t temp;
    
    for (i=0; i<TP_READ_TIMES; i++)                             /* 先读取TP_READ_TIMES次数据 */
    {
        buf[i] = tp_read_ad(cmd);
    }
    
    for (i=0; i<(TP_READ_TIMES - 1); i++)                       /* 对数据进行排序 */
    {
        for (j=(i + 1); j<TP_READ_TIMES; j++)
        {
            if (buf[i] > buf[j])                                /* 升序排列 */
            {
                temp = buf[i];
                buf[i] = buf[j];
                buf[j] = temp;
            }
        }
    }
    
    for (i=TP_LOST_VAL; i<(TP_READ_TIMES - TP_LOST_VAL); i++)   /* 去掉两端的丢弃值 */
    {
        sum += buf[i];                                          /* 累加去掉丢弃值以后的数据 */
    }
    
    temp = sum / (TP_READ_TIMES - 2 * TP_LOST_VAL);             /* 取平均值 */
    
    return temp;
}

/**
 * @brief       读取X/Y坐标
 * @param       x: 读取到的X坐标
 * @param       y: 读取到的Y坐标
 * @retval      无
 */
static void tp_read_xy(uint16_t *x, uint16_t *y)
{
    uint16_t xval;
    uint16_t yval;
    
    if (tp_dev.touchtype & 0x01)    /* X/Y方向与屏幕相反 */
    {
        xval = tp_read_xoy(0x90);   /* 读取X轴坐标AD值 */
        yval = tp_read_xoy(0xD0);   /* 读取Y轴坐标AD值 */
    }
    else                            /* X/Y方向与屏幕相同 */
    {
        xval = tp_read_xoy(0xD0);   /* 读取X轴坐标AD值 */
        yval = tp_read_xoy(0x90);   /* 读取Y轴坐标AD值 */
    }
    
    *x = xval;
    *y = yval;
}

/* 连续两次读取坐标数据允许的最大误差定义 */
#define TP_ERR_RANGE    50  /* 误差范围 */

/**
 * @brief       连续读取2次触摸IC数据，并滤波
 * @note        连续2次读取触摸屏IC，且这两次的偏差不能超过ERR_RANGE，满足
 *              条件，则认为读数正确，否则读数错误.该函数能大大提高准确度
 * @param       x: 读取到的X坐标
 * @param       y: 读取到的Y坐标
 * @retval      读取结果
 *              0: 失败
 *              1: 成功
 */
static uint8_t tp_read_xy2(uint16_t *x, uint16_t *y)
{
    uint16_t x1;
    uint16_t y1;
    uint16_t x2;
    uint16_t y2;
    
    tp_read_xy(&x1, &y1);   /* 读取第一次数据 */
    tp_read_xy(&x2, &y2);   /* 读取第二次数据 */
    
    /* 前后两次采样在+-TP_ERR_RANGE内 */
    if (((x2 <= x1 && x1 < x2 + TP_ERR_RANGE) || (x1 <= x2 && x2 < x1 + TP_ERR_RANGE)) &&
            ((y2 <= y1 && y1 < y2 + TP_ERR_RANGE) || (y1 <= y2 && y2 < y1 + TP_ERR_RANGE)))
    {
        *x = (x1 + x2) / 2;
        *y = (y1 + y2) / 2;
        
        return 1;
    }
    
    return 0;
}

/**
 * @brief       画一个校准用的触摸点（十字架）
 * @param       x    : 十字架的X坐标
 * @param       y    : 十字架的Y坐标
 * @param       color: 十字架的颜色
 * @retval      无
 */
static void tp_draw_touch_point(uint16_t x, uint16_t y, uint16_t color)
{
    lcd_draw_line(x - 12, y, x + 13, y, color);
    lcd_draw_line(x, y - 12, x, y + 13, color);
    lcd_draw_point(x + 1, y + 1, color);
    lcd_draw_point(x - 1, y + 1, color);
    lcd_draw_point(x + 1, y - 1, color);
    lcd_draw_point(x - 1, y - 1, color);
    lcd_draw_circle(x, y, 6, color);
}

/**
 * @brief       画一个大点
 * @note        画一个2*2的点
 * @param       x    : 点的X坐标
 * @param       y    : 点的Y坐标
 * @param       color: 点的颜色
 * @retval      无
 */
void tp_draw_big_point(uint16_t x, uint16_t y, uint16_t color)
{
    lcd_draw_point(x, y, color);
    lcd_draw_point(x + 1, y, color);
    lcd_draw_point(x, y + 1, color);
    lcd_draw_point(x + 1, y + 1, color);
}

/**
 * @brief       触摸屏扫描
 * @param       mode: 坐标模式
 *   @arg       0: 屏幕坐标
 *   @arg       1: 物理坐标（校准等特殊场合用）
 * @retval      当前触摸状态
 *              0: 无触摸
 *              1: 有触摸
 */
uint8_t tp_scan(uint8_t mode)
{
    if (T_PEN == 0)                                                                                     /* 有触摸按下 */
    {
        if (mode)                                                                                       /* 读取物理坐标，无需转换 */
        {
            tp_read_xy2(&tp_dev.x[0], &tp_dev.y[0]);
        }
        else if (tp_read_xy2(&tp_dev.x[0], &tp_dev.y[0]))                                               /* 读取屏幕坐标，需要转换 */
        {
            tp_dev.x[0] = (signed short)(tp_dev.x[0] - tp_dev.xc) / tp_dev.xfac + lcddev.width / 2;     /* 将X轴物理坐标转换成逻辑坐标（即对应LCD屏幕上面的X坐标值） */
            tp_dev.y[0] = (signed short)(tp_dev.y[0] - tp_dev.yc) / tp_dev.yfac + lcddev.height / 2;    /* 将Y轴物理坐标转换成逻辑坐标（即对应LCD屏幕上面的Y坐标值） */
        }
        
