autumnTQ/STM32F407/2.测试程序/1.模拟下位机与电机通信/HARDWARE/TOUCH/touch.c
        if ((tp_dev.sta & TP_PRES_DOWN) == 0)                                                           /* 之前没有被按下 */
        {
            tp_dev.sta = TP_PRES_DOWN | TP_CATH_PRES;                                                   /* 按键按下 */
            tp_dev.x[CT_MAX_TOUCH - 1] = tp_dev.x[0];                                                   /* 记录第一次按下时的坐标 */
            tp_dev.y[CT_MAX_TOUCH - 1] = tp_dev.y[0];
        }
    }
    else                                                                                                /* 无触摸按下 */
    {
        if (tp_dev.sta & TP_PRES_DOWN)                                                                  /* 之前是被按下的 */
        {
            tp_dev.sta &= ~TP_PRES_DOWN;                                                                /* 标记按键松开 */
        }
        else                                                                                            /* 之前就没有被按下 */
        {
            tp_dev.x[CT_MAX_TOUCH - 1] = 0;
            tp_dev.y[CT_MAX_TOUCH - 1] = 0;
            tp_dev.x[0] = 0xFFFF;
            tp_dev.y[0] = 0xFFFF;
        }
    }
    
    return tp_dev.sta & TP_PRES_DOWN;                                                                   /* 返回当前的触屏状态 */
}

/* TP_SAVE_ADDR_BASE定义触摸屏校准参数保存在EEPROM里面的位置（起始地址）
 * 占用空间: 13字节
 */
#define TP_SAVE_ADDR_BASE   40

/**
 * @brief       保存校准参数
 * @note        参数保存在EEPROM芯片里面（24C02），起始地址为TP_SAVE_ADDR_BASE
 *              占用大小为13字节
 * @param       无
 * @retval      无
 */
void tp_save_adjust_data(void)
{
    uint8_t *p;
    
    /* p指向tp_dev.xfac的地址
     * p+4则是tp_dev.yfac的地址
     * p+8则是tp_dev.xoff的地址
     * p+10则是tp_dev.yoff的地址
     * 总共占用12个字节（4个参数）
     * p+12用于存放标记电阻触摸屏是否校准的数据（0x0A）
     * 往p[12]写入0x0A标记已经校准过
     */
    p = (uint8_t *)&tp_dev.xfac;                            /* 指向首地址 */
    at24cxx_write(TP_SAVE_ADDR_BASE, p, 12);                /* 保存12个字节数据（xfac、yfac、xc、yc） */
    at24cxx_write_one_byte(TP_SAVE_ADDR_BASE + 12, 0x0A);   /* 保存校准值 */
}

/**
 * @brief       获取保存在EEPROM里面的校准值
 * @param       无
 * @retval      获取结果
 *              0: 失败
 *              1: 成功
 */
static uint8_t tp_get_adjust_data(void)
{
    uint8_t *p;
    uint8_t temp;
    
    p = (uint8_t *)&tp_dev.xfac;
    /* 由于我们是直接指向tp_dev.xfac地址进行保存的，读取的时候，将读取出来的数据
     * 写入指向tp_dev.xfac的首地址，就可以还原写入进去的值，而不需要理会具体的数
     * 据类型
     */
    at24cxx_read(TP_SAVE_ADDR_BASE, p, 12);                 /* 读取12字节数据 */
    temp = at24cxx_read_one_byte(TP_SAVE_ADDR_BASE + 12);   /* 读取校准状态标记 */
    if (temp == 0x0A)
    {
        return 1;
    }
    
    return 0;
}

/* 提示字符串 */
static char *TP_REMIND_MSG_TBL = "Please use the stylus click the cross on the screen.The cross will always move until the screen adjustment is completed.";

/**
 * @brief       提示校准结果（各个参数）
 * @param       xy[5][2]: 5个物理坐标值
 * @param       px      : X方向的比例因子（约接近1越好）
 * @param       py      : Y方向的比例因子（约接近1越好）
 * @retval      无
 */
static void tp_adjust_info_show(uint16_t xy[5][2], double px, double py)
{
    uint8_t i;
    char sbuf[20];
    
    for (i=0; i<5; i++)                                                                         /* 显示5个物理坐标值 */
    {
        sprintf(sbuf, "x%d:%d", i + 1, xy[i][0]);
        lcd_show_string(40, 160 + (i * 20), lcddev.width, lcddev.height, 16, sbuf, RED);
        sprintf(sbuf, "y%d:%d", i + 1, xy[i][1]);
        lcd_show_string(40 + 80, 160 + (i * 20), lcddev.width, lcddev.height, 16, sbuf, RED);
    }
    
    /* 显示X/Y方向的比例因子 */
    lcd_fill(40, 160 + (i * 20), lcddev.width - 1, 16, WHITE);                                  /* 清除之前的px、py显示 */
    sprintf(sbuf, "px:%0.2f", px);
    sbuf[7] = 0;                                                                                /* 添加结束符 */
    lcd_show_string(40, 160 + (i * 20), lcddev.width, lcddev.height, 16, sbuf, RED);
    sprintf(sbuf, "py:%0.2f", py);
    sbuf[7] = 0;                                                                                /* 添加结束符 */
    lcd_show_string(40 + 80, 160 + (i * 20), lcddev.width, lcddev.height, 16, sbuf, RED);
}

/**
 * @brief       触摸屏校准
 * @note        使用五点校准法
 *              本函数得到X轴/Y轴比例因子xfac/yfac及物理中心坐标值(xc,yc)等4个参数
 *              物理坐标即AD采集到的坐标值，范围是0~4095
 *              逻辑坐标即LCD屏幕的坐标，范围为LCD屏幕的分辨率
 * @param       无
 * @retval      无
 */
void tp_adjust(void)
{
    uint16_t pxy[5][2];                                                                                         /* 物理坐标缓存值 */
    uint8_t cnt = 0;
    short s1;                                                                                                   /* 第1个点的坐标差值 */
    short s2;                                                                                                   /* 第2个点的坐标差值 */
    short s3;                                                                                                   /* 第3个点的坐标差值 */
    short s4;                                                                                                   /* 第4个点的坐标差值 */
    double px;                                                                                                  /* X轴物理坐标比例,用于判定是否校准成功 */
    double py;                                                                                                  /* Y轴物理坐标比例,用于判定是否校准成功 */
    uint16_t outtime = 0;
    
    lcd_clear(WHITE);                                                                                           /* 清屏 */
    lcd_show_string(40, 40, 160, 100, 16, TP_REMIND_MSG_TBL, RED);                                              /* 显示提示信息 */
    tp_draw_touch_point(20, 20, RED);                                                                           /* 画点1 */
    tp_dev.sta = 0;                                                                                             /* 消除触发信号 */
    
    while (1)                                                                                                   /* 如果连续10秒钟没有按下,则自动退出 */
    {
        tp_dev.scan(1);                                                                                         /* 扫描物理坐标 */
        
