autumnTQ/STM32F407/2.测试程序/1.模拟下位机与电机通信/HARDWARE/TOUCH/touch.c
        if ((tp_dev.sta & 0xC000) == TP_CATH_PRES)                                                              /* 按键按下了一次（此时按键松开了） */
        {
            outtime = 0;
            tp_dev.sta &= ~TP_CATH_PRES;                                                                        /* 标记按键已经被处理过了 */
            pxy[cnt][0] = tp_dev.x[0];                                                                          /* 保存X物理坐标 */
            pxy[cnt][1] = tp_dev.y[0];                                                                          /* 保存Y物理坐标 */
            cnt++;
            switch (cnt)
            {
                case 1:
                {
                    tp_draw_touch_point(20, 20, WHITE);                                                         /* 清除点1 */
                    tp_draw_touch_point(lcddev.width - 20, 20, RED);                                            /* 画点2 */
                    break;
                }
                case 2:
                {
                    tp_draw_touch_point(lcddev.width - 20, 20, WHITE);                                          /* 清除点2 */
                    tp_draw_touch_point(20, lcddev.height - 20, RED);                                           /* 画点3 */
                    break;
                }
                case 3:
                {
                    tp_draw_touch_point(20, lcddev.height - 20, WHITE);                                         /* 清除点3 */
                    tp_draw_touch_point(lcddev.width - 20, lcddev.height - 20, RED);                            /* 画点4 */
                    break;
                }
                case 4:
                {
                    lcd_clear(WHITE);                                                                           /* 画第五个点了, 直接清屏 */
                    tp_draw_touch_point(lcddev.width / 2, lcddev.height / 2, RED);                              /* 画点5 */
                    break;
                }
                case 5:                                                                                         /* 全部5个点已经得到 */
                {
                    s1 = pxy[1][0] - pxy[0][0];                                                                 /* 第2个点和第1个点的X轴物理坐标差值（AD值） */
                    s3 = pxy[3][0] - pxy[2][0];                                                                 /* 第4个点和第3个点的X轴物理坐标差值（AD值） */
                    s2 = pxy[3][1] - pxy[1][1];                                                                 /* 第4个点和第2个点的Y轴物理坐标差值（AD值） */
                    s4 = pxy[2][1] - pxy[0][1];                                                                 /* 第3个点和第1个点的Y轴物理坐标差值（AD值） */
                    
                    px = (double)s1 / s3;                                                                       /* X轴比例因子 */
                    py = (double)s2 / s4;                                                                       /* Y轴比例因子 */
                    
                    if (px < 0)
                    {
                        px = -px;                                                                               /* 负数改正数 */
                    }
                    if (py < 0)
                    {
                        py = -py;                                                                               /* 负数改正数 */
                    }
                    
                    if ((px < 0.95) || (px > 1.05) || (py < 0.95) || (py > 1.05) ||                             /* 比例不合格 */
                        (abs(s1) > 4095) || (abs(s2) > 4095) || (abs(s3) > 4095) || (abs(s4) > 4095) ||         /* 差值不合格，大于坐标范围 */
                        (abs(s1) == 0) || (abs(s2) == 0) || (abs(s3) == 0) || (abs(s4) == 0)                    /* 差值不合格，等于0 */
                       )
                    {
                        cnt = 0;
                        tp_draw_touch_point(lcddev.width / 2, lcddev.height / 2, WHITE);                        /* 清除点5 */
                        tp_draw_touch_point(20, 20, RED);                                                       /* 重新画点1 */
                        tp_adjust_info_show(pxy, px, py);                                                       /* 显示当前信息，方便找问题 */
                        continue;
                    }
                    
                    tp_dev.xfac = (float)(s1 + s3) / (2 * (lcddev.width - 40));
                    tp_dev.yfac = (float)(s2 + s4) / (2 * (lcddev.height - 40));
                    
                    tp_dev.xc = pxy[4][0];                                                                      /* X轴，物理中心坐标 */
                    tp_dev.yc = pxy[4][1];                                                                      /* Y轴，物理中心坐标 */
                    
                    lcd_clear(WHITE);                                                                           /* 清屏 */
                    lcd_show_string(35, 110, lcddev.width, lcddev.height, 16, "Touch Screen Adjust OK!", BLUE); /* 校正完成 */
                    delay_ms(1000);
                    tp_save_adjust_data();
                    lcd_clear(WHITE);                                                                           /* 清屏 */
                    
                    return;                                                                                     /* 校正完成 */
                }
            }
        }
        
        delay_ms(10);
        outtime++;
        if (outtime > 1000)
        {
            tp_get_adjust_data();
            break;
        }
    }
}

/**
 * @brief       初始化触摸屏
 * @param       无
 * @retval      触摸屏是否校准
 *              0: 否
 *              1: 是
 */
uint8_t tp_init(void)
{
    GPIO_Config_T gpio_init_struct;
    
    tp_dev.touchtype = 0;                                                               /* 默认设置（电阻屏、竖屏） */
    tp_dev.touchtype |= lcddev.dir & 0x01;                                              /* 根据LCD判断是横屏还是竖屏 */
    
    if ((lcddev.id == 0x5510) || (lcddev.id == 0x4342) || (lcddev.id == 0x1018))        /* 电容触摸屏，4.3寸/10.1寸屏 */
    {
        gt9xxx_init();
        tp_dev.scan = gt9xxx_scan;                                                      /* 设置触摸屏扫描函数 */
        tp_dev.touchtype |= 0x80;                                                       /* 电容屏 */
    }
    else if ((lcddev.id == 0x1963) || (lcddev.id == 0x7084) || (lcddev.id == 0x7016))   /* SSD1963 7寸屏或7寸800*480/1024*600 RGB屏 */
    {
        ft5206_init();
        tp_dev.scan = ft5206_scan;                                                      /* 设置触摸屏扫描函数 */
        tp_dev.touchtype |= 0x80;                                                       /* 电容屏 */
    }
    else                                                                                /* 电阻屏 */
    {
        /* 使能时钟 */
        T_PEN_GPIO_CLK_ENABLE();                                                        /* 使能T_PEN引脚端口时钟 */
        T_CS_GPIO_CLK_ENABLE();                                                         /* 使能T_CS引脚端口时钟 */
        T_MISO_GPIO_CLK_ENABLE();                                                       /* 使能T_MISO引脚端口时钟 */
        T_MOSI_GPIO_CLK_ENABLE();                                                       /* 使能T_MOSI引脚端口时钟 */
        T_CLK_GPIO_CLK_ENABLE();                                                        /* 使能T_CLK引脚端口时钟 */
        
        /* 配置T_PEN引脚 */
        gpio_init_struct.pin = T_PEN_GPIO_PIN;                                          /* T_PEN引脚 */
        gpio_init_struct.mode = GPIO_MODE_IN;                                           /* 输入模式 */
        gpio_init_struct.pupd = GPIO_PUPD_UP;                                           /* 上拉 */
        GPIO_Config(T_PEN_GPIO_PORT, &gpio_init_struct);                                /* 配置T_PEN引脚 */
        
