autumnTQ/STM32F407/2.测试程序/1.模拟下位机与电机通信/HARDWARE/TOUCH/touch.c
        /* 配置T_CS引脚 */
        gpio_init_struct.pin = T_CS_GPIO_PIN;                                           /* T_CS引脚 */
        gpio_init_struct.mode = GPIO_MODE_OUT;                                          /* 通用输出模式 */
        gpio_init_struct.speed = GPIO_SPEED_100MHz;                                     /* 高速 */
        gpio_init_struct.otype = GPIO_OTYPE_PP;                                         /* 推挽输出 */
        gpio_init_struct.pupd = GPIO_PUPD_UP;                                           /* 上拉 */
        GPIO_Config(T_CS_GPIO_PORT, &gpio_init_struct);                                 /* 配置T_CS引脚 */
        
        /* 配置T_MISO引脚 */
        gpio_init_struct.pin = T_MISO_GPIO_PIN;                                         /* T_MISO引脚 */
        gpio_init_struct.mode = GPIO_MODE_IN;                                           /* 输入模式 */
        gpio_init_struct.pupd = GPIO_PUPD_UP;                                           /* 上拉 */
        GPIO_Config(T_MISO_GPIO_PORT, &gpio_init_struct);                               /* 配置T_MISO引脚 */
        
        /* 配置T_MOSI引脚 */
        gpio_init_struct.pin = T_MOSI_GPIO_PIN;                                         /* T_MOSI引脚 */
        gpio_init_struct.mode = GPIO_MODE_OUT;                                          /* 通用输出模式 */
        gpio_init_struct.speed = GPIO_SPEED_100MHz;                                     /* 高速 */
        gpio_init_struct.otype = GPIO_OTYPE_PP;                                         /* 推挽输出 */
        gpio_init_struct.pupd = GPIO_PUPD_UP;                                           /* 上拉 */
        GPIO_Config(T_MOSI_GPIO_PORT, &gpio_init_struct);                               /* 配置T_MOSI引脚 */
        
        /* 配置T_CLK引脚 */
        gpio_init_struct.pin = T_CLK_GPIO_PIN;                                          /* T_CLK引脚 */
        gpio_init_struct.mode = GPIO_MODE_OUT;                                          /* 通用输出模式 */
        gpio_init_struct.speed = GPIO_SPEED_100MHz;                                     /* 高速 */
        gpio_init_struct.otype = GPIO_OTYPE_PP;                                         /* 推挽输出 */
        gpio_init_struct.pupd = GPIO_PUPD_UP;                                           /* 上拉 */
        GPIO_Config(T_CLK_GPIO_PORT, &gpio_init_struct);                                /* 配置T_CLK引脚 */
        
        tp_read_xy(&tp_dev.x[0], &tp_dev.y[0]);                                         /* 第一次读取初始化 */
        at24cxx_init();                                                                 /* 初始化AT24CXX */
        
        if (tp_get_adjust_data())                                                       /* 已校准触摸 */
        {
            return 0;
        }
        else                                                                            /* 未校准触摸 */
        {
            tp_adjust();                                                                /* 触摸屏校准 */
            tp_save_adjust_data();                                                      /* 保存校准参数 */
        }
        
        tp_get_adjust_data();                                                           /* 获取触摸屏校准参数 */
    }
    
    return 1;
}
